// Access Multi-Dimensional Arrays With Indexes
// คุณอาจนึกถึง multi-dimensional array ว่าเป็น อาร์เรย์ซ้อนอาร์เรย์ ก็ได้ เมื่อคุณใช้ brackets (วงเล็บ) เพื่อเข้าถึง array ของคุณ ิbrackets ชุดแรกจะอ้างอิงถึงรายการใน array ที่อยู่นอกสุด (ระดับแรก) และ brackets คู่ถัดมาจะอ้างอิงถึงรายการ array ในระดับถัดไป

// Example

var arr = [
  [1,2,3],
  [4,5,6],
  [7,8,9],
  [[10,11,12], 13, 14]
];
// arr[3];
// arr[3][0];
// arr[3][0][1];
// arr[3] คือ [[10, 11, 12], 13, 14], arr[3][0] คือ [10, 11, 12] และ arr[3][0][1] คือ 11.

// หมายเหตุ: ไม่ควรมีช่องว่างระหว่างชื่อ array และ square brackets เช่น array [0][0] และแม้แต่ array [0] [0] แบบนี้ก็ไม่อนุญาต แม้ว่า JavaScript สามารถประมวลผลได้อย่างถูกต้อง แต่อาจทำให้โปรแกรมเมอร์คนอื่นอ่านโค้ดของคุณแล้วสับสน

// จงใช้ bracket notation ในการเลือก element จาก myArray เพื่อให้ myData มีค่าเท่ากับ 8
var myArray = [[1,2,3], [4,5,6], [7,8,9], [[10,11,12], 13, 14]];

var myData = myArray[2][1];
