// Strict equality (===) คล้ายคลึงกับ equality operator (==) อย่างไรก็ตาม สิ่งที่แตกต่างกันคือ เครื่องหมาย (==) พยายามที่จะแปลงค่า ทั้งสองที่เปรียบเทียบกันให้เป็น common type ส่วนเครื่องหมาย (===) ไม่ได้ทำเรื่องการเปลี่ยนประเภทของข้อมูลให้

// ถ้าค่าทั้งสองที่ถูกเปรียบเทียบมีประเภทต่างกัน จะถูกพิจารณาว่าไม่เท่ากัน และ เครื่องหมาย (===) จะส่งคืนค่าเป็น false

// Examples

// 3 ===  3
// 3 === '3'
// เงื่อนไขนี้จะคืนค่า true และ false ตามลำดับ

// ในตัวอย่างที่สอง 3 เป็นประเภท Number และ '3' เป็นประเภท String

// จงใช้เครื่องหมาย (===) ในคำสั่ง if เพื่อให้ function คืนค่า string Equal เมื่อ val เท่ากับ 7 เท่านั้น
// Setup
function testStrict(val) {
    if (val===7) { // Change this line
      return "Equal";
    }
    return "Not Equal";
  }
  
  testStrict(10);